betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dac.h
/** @defgroup DAC_DDL_EC_GET_FLAG DAC flags
  * @brief    Flags defines which can be used with DDL_DAC_ReadReg function
  * @{
  */
/* DAC channel 1 flags */
#define DDL_DAC_FLAG_DMAUDR1                (DAC_STS_DMAUDFLG1)   /*!< DAC channel 1 flag DMA underrun */
#if defined(DAC_CHANNEL2_SUPPORT)
/* DAC channel 2 flags */
#define DDL_DAC_FLAG_DMAUDR2                (DAC_STS_DMAUDFLG2)   /*!< DAC channel 2 flag DMA underrun */
#endif /* DAC_CHANNEL2_SUPPORT */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_IT DAC interruptions
  * @brief    IT defines which can be used with DDL_DAC_ReadReg and  DDL_DAC_WriteReg functions
  * @{
  */
#define DDL_DAC_IT_DMAUDRIE1                (DAC_CTRL_DMAUDIEN1) /*!< DAC channel 1 interruption DMA underrun */
#if defined(DAC_CHANNEL2_SUPPORT)
#define DDL_DAC_IT_DMAUDRIE2                (DAC_CTRL_DMAUDIEN2) /*!< DAC channel 2 interruption DMA underrun */
#endif /* DAC_CHANNEL2_SUPPORT */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_CHANNEL DAC channels
  * @{
  */
#define DDL_DAC_CHANNEL_1                   (DAC_REG_DOR1_REGOFFSET | DAC_REG_DHR12R1_REGOFFSET | DAC_REG_DHR12L1_REGOFFSET | DAC_REG_DHR8R1_REGOFFSET | DAC_CTRL_CH1_BITOFFSET | DAC_SWTR_CH1) /*!< DAC channel 1 */
#if defined(DAC_CHANNEL2_SUPPORT)
#define DDL_DAC_CHANNEL_2                   (DAC_REG_DOR2_REGOFFSET | DAC_REG_DHR12R2_REGOFFSET | DAC_REG_DHR12L2_REGOFFSET | DAC_REG_DHR8R2_REGOFFSET | DAC_CTRL_CH2_BITOFFSET | DAC_SWTR_CH2) /*!< DAC channel 2 */
#endif /* DAC_CHANNEL2_SUPPORT */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_TRIGGER_SOURCE DAC trigger source
  * @{
  */
#define DDL_DAC_TRIG_SOFTWARE               (DAC_CTRL_TRGSELCH1_2 | DAC_CTRL_TRGSELCH1_1 | DAC_CTRL_TRGSELCH1_0) /*!< DAC channel conversion trigger internal (SW start) */
#define DDL_DAC_TRIG_EXT_TMR2_TRGO          (DAC_CTRL_TRGSELCH1_2                                  ) /*!< DAC channel conversion trigger from external peripheral: TIM2 TRGO. */
#define DDL_DAC_TRIG_EXT_TMR8_TRGO          (                                  DAC_CTRL_TRGSELCH1_0) /*!< DAC channel conversion trigger from external peripheral: TIM8 TRGO. */
#define DDL_DAC_TRIG_EXT_TMR4_TRGO          (DAC_CTRL_TRGSELCH1_2                  | DAC_CTRL_TRGSELCH1_0) /*!< DAC channel conversion trigger from external peripheral: TIM4 TRGO. */
#define DDL_DAC_TRIG_EXT_TMR6_TRGO          0x00000000UL                                       /*!< DAC channel conversion trigger from external peripheral: TIM6 TRGO. */
#define DDL_DAC_TRIG_EXT_TMR7_TRGO          (                 DAC_CTRL_TRGSELCH1_1                 ) /*!< DAC channel conversion trigger from external peripheral: TIM7 TRGO. */
#define DDL_DAC_TRIG_EXT_TMR5_TRGO          (                 DAC_CTRL_TRGSELCH1_1 | DAC_CTRL_TRGSELCH1_0) /*!< DAC channel conversion trigger from external peripheral: TIM5 TRGO. */
#define DDL_DAC_TRIG_EXT_EINT_LINE9         (DAC_CTRL_TRGSELCH1_2 | DAC_CTRL_TRGSELCH1_1                 ) /*!< DAC channel conversion trigger from external peripheral: external interrupt line 9. */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_WAVE_AUTO_GENERATION_MODE DAC waveform automatic generation mode
  * @{
  */
#define DDL_DAC_WAVE_AUTO_GENERATION_NONE     0x00000000UL                    /*!< DAC channel wave auto generation mode disabled. */
#define DDL_DAC_WAVE_AUTO_GENERATION_NOISE    (               DAC_CTRL_WAVENCH1_0) /*!< DAC channel wave auto generation mode enabled, set generated noise waveform. */
#define DDL_DAC_WAVE_AUTO_GENERATION_TRIANGLE (DAC_CTRL_WAVENCH1_1               ) /*!< DAC channel wave auto generation mode enabled, set generated triangle waveform. */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_WAVE_NOISE_LFSR_UNMASK_BITS DAC wave generation - Noise LFSR unmask bits
  * @{
  */
#define DDL_DAC_NOISE_LFSR_UNMASK_BIT0      0x00000000UL                                                        /*!< Noise wave generation, unmask LFSR bit0, for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS1_0   (                                                   DAC_CTRL_MAMPSELCH1_0) /*!< Noise wave generation, unmask LFSR bits[1:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS2_0   (                                  DAC_CTRL_MAMPSELCH1_1                 ) /*!< Noise wave generation, unmask LFSR bits[2:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS3_0   (                                  DAC_CTRL_MAMPSELCH1_1 | DAC_CTRL_MAMPSELCH1_0) /*!< Noise wave generation, unmask LFSR bits[3:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS4_0   (                 DAC_CTRL_MAMPSELCH1_2                                  ) /*!< Noise wave generation, unmask LFSR bits[4:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS5_0   (                 DAC_CTRL_MAMPSELCH1_2                  | DAC_CTRL_MAMPSELCH1_0) /*!< Noise wave generation, unmask LFSR bits[5:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS6_0   (                 DAC_CTRL_MAMPSELCH1_2 | DAC_CTRL_MAMPSELCH1_1                 ) /*!< Noise wave generation, unmask LFSR bits[6:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS7_0   (                 DAC_CTRL_MAMPSELCH1_2 | DAC_CTRL_MAMPSELCH1_1 | DAC_CTRL_MAMPSELCH1_0) /*!< Noise wave generation, unmask LFSR bits[7:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS8_0   (DAC_CTRL_MAMPSELCH1_3                                                   ) /*!< Noise wave generation, unmask LFSR bits[8:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS9_0   (DAC_CTRL_MAMPSELCH1_3                                   | DAC_CTRL_MAMPSELCH1_0) /*!< Noise wave generation, unmask LFSR bits[9:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS10_0  (DAC_CTRL_MAMPSELCH1_3                  | DAC_CTRL_MAMPSELCH1_1                 ) /*!< Noise wave generation, unmask LFSR bits[10:0], for the selected DAC channel */
#define DDL_DAC_NOISE_LFSR_UNMASK_BITS11_0  (DAC_CTRL_MAMPSELCH1_3                  | DAC_CTRL_MAMPSELCH1_1 | DAC_CTRL_MAMPSELCH1_0) /*!< Noise wave generation, unmask LFSR bits[11:0], for the selected DAC channel */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_WAVE_TRIANGLE_AMPLITUDE DAC wave generation - Triangle amplitude
  * @{
  */
#define DDL_DAC_TRIANGLE_AMPLITUDE_1        0x00000000UL                                                        /*!< Triangle wave generation, amplitude of 1 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_3        (                                                   DAC_CTRL_MAMPSELCH1_0) /*!< Triangle wave generation, amplitude of 3 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_7        (                                  DAC_CTRL_MAMPSELCH1_1                 ) /*!< Triangle wave generation, amplitude of 7 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_15       (                                  DAC_CTRL_MAMPSELCH1_1 | DAC_CTRL_MAMPSELCH1_0) /*!< Triangle wave generation, amplitude of 15 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_31       (                 DAC_CTRL_MAMPSELCH1_2                                  ) /*!< Triangle wave generation, amplitude of 31 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_63       (                 DAC_CTRL_MAMPSELCH1_2                  | DAC_CTRL_MAMPSELCH1_0) /*!< Triangle wave generation, amplitude of 63 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_127      (                 DAC_CTRL_MAMPSELCH1_2 | DAC_CTRL_MAMPSELCH1_1                 ) /*!< Triangle wave generation, amplitude of 127 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_255      (                 DAC_CTRL_MAMPSELCH1_2 | DAC_CTRL_MAMPSELCH1_1 | DAC_CTRL_MAMPSELCH1_0) /*!< Triangle wave generation, amplitude of 255 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_511      (DAC_CTRL_MAMPSELCH1_3                                                   ) /*!< Triangle wave generation, amplitude of 512 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_1023     (DAC_CTRL_MAMPSELCH1_3                                   | DAC_CTRL_MAMPSELCH1_0) /*!< Triangle wave generation, amplitude of 1023 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_2047     (DAC_CTRL_MAMPSELCH1_3                  | DAC_CTRL_MAMPSELCH1_1                 ) /*!< Triangle wave generation, amplitude of 2047 LSB of DAC output range, for the selected DAC channel */
#define DDL_DAC_TRIANGLE_AMPLITUDE_4095     (DAC_CTRL_MAMPSELCH1_3                  | DAC_CTRL_MAMPSELCH1_1 | DAC_CTRL_MAMPSELCH1_0) /*!< Triangle wave generation, amplitude of 4095 LSB of DAC output range, for the selected DAC channel */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_OUTPUT_BUFFER DAC channel output buffer
  * @{
  */
#define DDL_DAC_OUTPUT_BUFFER_ENABLE        0x00000000UL            /*!< The selected DAC channel output is buffered: higher drive current capability, but also higher current consumption */
#define DDL_DAC_OUTPUT_BUFFER_DISABLE       (DAC_CTRL_BUFFDCH1)          /*!< The selected DAC channel output is not buffered: lower drive current capability, but also lower current consumption */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_RESOLUTION  DAC channel output resolution
  * @{
  */
#define DDL_DAC_RESOLUTION_12B              0x00000000UL            /*!< DAC channel resolution 12 bits */
#define DDL_DAC_RESOLUTION_8B               0x00000002UL            /*!< DAC channel resolution 8 bits */
/**
  * @}
  */

/** @defgroup DAC_DDL_EC_REGISTERS  DAC registers compliant with specific purpose
  * @{
  */
/* List of DAC registers intended to be used (most commonly) with             */
/* DMA transfer.                                                              */
/* Refer to function @ref DDL_DAC_DMA_GetRegAddr().                            */
#define DDL_DAC_DMA_REG_DATA_12BITS_RIGHT_ALIGNED  DAC_REG_DHR12RX_REGOFFSET_BITOFFSET_POS /*!< DAC channel data holding register 12 bits right aligned */
#define DDL_DAC_DMA_REG_DATA_12BITS_LEFT_ALIGNED   DAC_REG_DHR12LX_REGOFFSET_BITOFFSET_POS /*!< DAC channel data holding register 12 bits left aligned */
#define DDL_DAC_DMA_REG_DATA_8BITS_RIGHT_ALIGNED   DAC_REG_DHR8RX_REGOFFSET_BITOFFSET_POS  /*!< DAC channel data holding register 8 bits right aligned */
/**
  * @}
  */

