betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dac.h
/** @defgroup DAC_DDL_EC_HW_DELAYS  Definitions of DAC hardware constraints delays
  * @note   Only DAC peripheral HW delays are defined in DAC LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

/* Delay for DAC channel voltage settling time from DAC channel startup       */
/* (transition from disable to enable).                                       */
/* Note: DAC channel startup time depends on board application environment:   */
/*       impedance connected to DAC channel output.                           */
/*       The delay below is specified under conditions:                       */
/*        - voltage maximum transition (lowest to highest value)              */
/*        - until voltage reaches final value +-1LSB                          */
/*        - DAC channel output buffer enabled                                 */
/*        - load impedance of 5kOhm (min), 50pF (max)                         */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tWAKEUP").                                                      */
/* Unit: us                                                                   */
#define DDL_DAC_DELAY_STARTUP_VOLTAGE_SETTLING_US             15UL /*!< Delay for DAC channel voltage settling time from DAC channel startup (transition from disable to enable) */

/* Delay for DAC channel voltage settling time.                               */
/* Note: DAC channel startup time depends on board application environment:   */
/*       impedance connected to DAC channel output.                           */
/*       The delay below is specified under conditions:                       */
/*        - voltage maximum transition (lowest to highest value)              */
/*        - until voltage reaches final value +-1LSB                          */
/*        - DAC channel output buffer enabled                                 */
/*        - load impedance of 5kOhm min, 50pF max                             */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSETTLING").                                                    */
/* Unit: us                                                                   */
#define DDL_DAC_DELAY_VOLTAGE_SETTLING_US                    12UL /*!< Delay for DAC channel voltage settling time */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup DAC_DDL_Exported_Macros DAC Exported Macros
  * @{
  */

/** @defgroup DAC_DDL_EM_WRITE_READ Common write and read registers macros
  * @{
  */

/**
  * @brief  Write a value in DAC register
  * @param  __INSTANCE__ DAC Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define DDL_DAC_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in DAC register
  * @param  __INSTANCE__ DAC Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define DDL_DAC_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)

/**
  * @}
  */

/** @defgroup DAC_DDL_EM_HELPER_MACRO DAC helper macro
  * @{
  */

/**
  * @brief  Helper macro to get DAC channel number in decimal format
  *         from literals DDL_DAC_CHANNEL_x.
  *         Example:
  *            __DDL_DAC_CHANNEL_TO_DECIMAL_NB(DDL_DAC_CHANNEL_1)
  *            will return decimal number "1".
  * @note   The input can be a value from functions where a channel
  *         number is returned.
  * @param  __CHANNEL__ This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @retval 1...2 (value "2" depending on DAC channel 2 availability)
  */
#define __DDL_DAC_CHANNEL_TO_DECIMAL_NB(__CHANNEL__)                            \
  ((__CHANNEL__) & DAC_SWTR_CHX_MASK)

/**
  * @brief  Helper macro to get DAC channel in literal format DDL_DAC_CHANNEL_x
  *         from number in decimal format.
  *         Example:
  *           __DDL_DAC_DECIMAL_NB_TO_CHANNEL(1)
  *           will return a data equivalent to "DDL_DAC_CHANNEL_1".
  * @note  If the input parameter does not correspond to a DAC channel,
  *        this macro returns value '0'.
  * @param  __DECIMAL_NB__ 1...2 (value "2" depending on DAC channel 2 availability)
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  */
#if defined(DAC_CHANNEL2_SUPPORT)
#define __DDL_DAC_DECIMAL_NB_TO_CHANNEL(__DECIMAL_NB__)                         \
  (((__DECIMAL_NB__) == 1UL)                                                   \
    ? (                                                                        \
       DDL_DAC_CHANNEL_1                                                        \
      )                                                                        \
      :                                                                        \
      (((__DECIMAL_NB__) == 2UL)                                               \
        ? (                                                                    \
           DDL_DAC_CHANNEL_2                                                    \
          )                                                                    \
          :                                                                    \
          (                                                                    \
           0UL                                                                 \
          )                                                                    \
      )                                                                        \
  )
#else
#define __DDL_DAC_DECIMAL_NB_TO_CHANNEL(__DECIMAL_NB__)                         \
  (((__DECIMAL_NB__) == 1UL)                                                   \
    ? (                                                                        \
       DDL_DAC_CHANNEL_1                                                        \
      )                                                                        \
      :                                                                        \
      (                                                                        \
       0UL                                                                     \
      )                                                                        \
  )
#endif /* DAC_CHANNEL2_SUPPORT */

/**
  * @brief  Helper macro to define the DAC conversion data full-scale digital
  *         value corresponding to the selected DAC resolution.
  * @note   DAC conversion data full-scale corresponds to voltage range
  *         determined by analog voltage references Vref+ and Vref-
  *         (refer to reference manual).
  * @param  __DAC_RESOLUTION__ This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_RESOLUTION_12B
  *         @arg @ref DDL_DAC_RESOLUTION_8B
  * @retval ADC conversion data equivalent voltage value (unit: mVolt)
  */
#define __DDL_DAC_DIGITAL_SCALE(__DAC_RESOLUTION__)                             \
  ((0x00000FFFUL) >> ((__DAC_RESOLUTION__) << 1UL))

/**
  * @brief  Helper macro to calculate the DAC conversion data (unit: digital
  *         value) corresponding to a voltage (unit: mVolt).
  * @note   This helper macro is intended to provide input data in voltage
  *         rather than digital value,
  *         to be used with LL DAC functions such as
  *         @ref DDL_DAC_ConvertData12RightAligned().
  * @note   Analog reference voltage (Vref+) must be either known from
  *         user board environment or can be calculated using ADC measurement
  *         and ADC helper macro __DDL_ADC_CALC_VREFANALOG_VOLTAGE().
  * @param  __VREFANALOG_VOLTAGE__ Analog reference voltage (unit: mV)
  * @param  __DAC_VOLTAGE__ Voltage to be generated by DAC channel
  *                         (unit: mVolt).
  * @param  __DAC_RESOLUTION__ This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_RESOLUTION_12B
  *         @arg @ref DDL_DAC_RESOLUTION_8B
  * @retval DAC conversion data (unit: digital value)
  */
#define __DDL_DAC_CALC_VOLTAGE_TO_DATA(__VREFANALOG_VOLTAGE__,\
                                      __DAC_VOLTAGE__,\
                                      __DAC_RESOLUTION__)                      \
((__DAC_VOLTAGE__) * __DDL_DAC_DIGITAL_SCALE(__DAC_RESOLUTION__)              \
 / (__VREFANALOG_VOLTAGE__)                                                  \
)

/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup DAC_DDL_Exported_Functions DAC Exported Functions
  * @{
  */
/**
  * @brief  Set the conversion trigger source for the selected DAC channel.
  * @note   For conversion trigger source to be effective, DAC trigger
  *         must be enabled using function @ref DDL_DAC_EnableTrigger().
  * @note   To set conversion trigger source, DAC channel must be disabled.
  *         Otherwise, the setting is discarded.
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @param  TriggerSource This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_TRIG_SOFTWARE
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR8_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR7_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR6_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR5_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR4_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR2_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_EINT_LINE9
  * @retval None
  */
__STATIC_INLINE void DDL_DAC_SetTriggerSource(DAC_TypeDef *DACx, uint32_t DAC_Channel, uint32_t TriggerSource)
{
  MODIFY_REG(DACx->CTRL,
             DAC_CTRL_TRGSELCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK),
             TriggerSource << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK));
}

/**
  * @brief  Get the conversion trigger source for the selected DAC channel.
  * @note   For conversion trigger source to be effective, DAC trigger
  *         must be enabled using function @ref DDL_DAC_EnableTrigger().
  * @note   Availability of parameters of trigger sources from timer
  *         depends on timers availability on the selected device.
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_DAC_TRIG_SOFTWARE
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR8_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR7_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR6_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR5_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR4_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_TMR2_TRGO
  *         @arg @ref DDL_DAC_TRIG_EXT_EINT_LINE9
  */
__STATIC_INLINE uint32_t DDL_DAC_GetTriggerSource(DAC_TypeDef *DACx, uint32_t DAC_Channel)
{
  return (uint32_t)(READ_BIT(DACx->CTRL, DAC_CTRL_TRGSELCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK))
                    >> (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK)
                   );
}

/**
  * @brief  Set the waveform automatic generation mode
  *         for the selected DAC channel.
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @param  WaveAutoGeneration This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_WAVE_AUTO_GENERATION_NONE
  *         @arg @ref DDL_DAC_WAVE_AUTO_GENERATION_NOISE
  *         @arg @ref DDL_DAC_WAVE_AUTO_GENERATION_TRIANGLE
  * @retval None
  */
__STATIC_INLINE void DDL_DAC_SetWaveAutoGeneration(DAC_TypeDef *DACx, uint32_t DAC_Channel, uint32_t WaveAutoGeneration)
{
  MODIFY_REG(DACx->CTRL,
             DAC_CTRL_WAVENCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK),
             WaveAutoGeneration << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK));
}

/**
  * @brief  Get the waveform automatic generation mode
  *         for the selected DAC channel.
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_DAC_WAVE_AUTO_GENERATION_NONE
  *         @arg @ref DDL_DAC_WAVE_AUTO_GENERATION_NOISE
  *         @arg @ref DDL_DAC_WAVE_AUTO_GENERATION_TRIANGLE
  */
__STATIC_INLINE uint32_t DDL_DAC_GetWaveAutoGeneration(DAC_TypeDef *DACx, uint32_t DAC_Channel)
{
  return (uint32_t)(READ_BIT(DACx->CTRL, DAC_CTRL_WAVENCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK))
                    >> (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK)
                   );
}

/**
  * @brief  Set the noise waveform generation for the selected DAC channel:
  *         Noise mode and parameters LFSR (linear feedback shift register).
  * @note   For wave generation to be effective, DAC channel
  *         wave generation mode must be enabled using
  *         function @ref DDL_DAC_SetWaveAutoGeneration().
  * @note   This setting can be set when the selected DAC channel is disabled
  *         (otherwise, the setting operation is ignored).
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @param  NoiseLFSRMask This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BIT0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS1_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS2_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS3_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS4_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS5_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS6_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS7_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS8_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS9_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS10_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS11_0
  * @retval None
  */
__STATIC_INLINE void DDL_DAC_SetWaveNoiseLFSR(DAC_TypeDef *DACx, uint32_t DAC_Channel, uint32_t NoiseLFSRMask)
{
  MODIFY_REG(DACx->CTRL,
             DAC_CTRL_MAMPSELCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK),
             NoiseLFSRMask << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK));
}

/**
  * @brief  Get the noise waveform generation for the selected DAC channel:
  *         Noise mode and parameters LFSR (linear feedback shift register).
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BIT0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS1_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS2_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS3_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS4_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS5_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS6_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS7_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS8_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS9_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS10_0
  *         @arg @ref DDL_DAC_NOISE_LFSR_UNMASK_BITS11_0
  */
__STATIC_INLINE uint32_t DDL_DAC_GetWaveNoiseLFSR(DAC_TypeDef *DACx, uint32_t DAC_Channel)
{
  return (uint32_t)(READ_BIT(DACx->CTRL, DAC_CTRL_MAMPSELCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK))
                    >> (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK)
                   );
}

/**
  * @brief  Set the triangle waveform generation for the selected DAC channel:
  *         triangle mode and amplitude.
  * @note   For wave generation to be effective, DAC channel
  *         wave generation mode must be enabled using
  *         function @ref DDL_DAC_SetWaveAutoGeneration().
  * @note   This setting can be set when the selected DAC channel is disabled
  *         (otherwise, the setting operation is ignored).
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @param  TriangleAmplitude This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_1
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_3
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_7
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_15
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_31
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_63
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_127
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_255
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_511
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_1023
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_2047
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_4095
  * @retval None
  */
__STATIC_INLINE void DDL_DAC_SetWaveTriangleAmplitude(DAC_TypeDef *DACx, uint32_t DAC_Channel,
                                                     uint32_t TriangleAmplitude)
{
  MODIFY_REG(DACx->CTRL,
             DAC_CTRL_MAMPSELCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK),
             TriangleAmplitude << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK));
}

/**
  * @brief  Get the triangle waveform generation for the selected DAC channel:
  *         triangle mode and amplitude.
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_1
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_3
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_7
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_15
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_31
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_63
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_127
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_255
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_511
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_1023
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_2047
  *         @arg @ref DDL_DAC_TRIANGLE_AMPLITUDE_4095
  */
__STATIC_INLINE uint32_t DDL_DAC_GetWaveTriangleAmplitude(DAC_TypeDef *DACx, uint32_t DAC_Channel)
{
  return (uint32_t)(READ_BIT(DACx->CTRL, DAC_CTRL_MAMPSELCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK))
                    >> (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK)
                   );
}

/**
  * @brief  Set the output buffer for the selected DAC channel.
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @param  OutputBuffer This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_OUTPUT_BUFFER_ENABLE
  *         @arg @ref DDL_DAC_OUTPUT_BUFFER_DISABLE
  * @retval None
  */
__STATIC_INLINE void DDL_DAC_SetOutputBuffer(DAC_TypeDef *DACx, uint32_t DAC_Channel, uint32_t OutputBuffer)
{
  MODIFY_REG(DACx->CTRL,
             DAC_CTRL_BUFFDCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK),
             OutputBuffer << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK));
}

/**
  * @brief  Get the output buffer state for the selected DAC channel.
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_DAC_OUTPUT_BUFFER_ENABLE
  *         @arg @ref DDL_DAC_OUTPUT_BUFFER_DISABLE
  */
__STATIC_INLINE uint32_t DDL_DAC_GetOutputBuffer(DAC_TypeDef *DACx, uint32_t DAC_Channel)
{
  return (uint32_t)(READ_BIT(DACx->CTRL, DAC_CTRL_BUFFDCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK))
                    >> (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK)
                   );
}

/**
  * @}
  */

/** @defgroup DAC_DDL_EF_DMA_Management DMA Management
  * @{
  */

/**
  * @brief  Enable DAC DMA transfer request of the selected channel.
  * @note   To configure DMA source address (peripheral address),
  *         use function @ref DDL_DAC_DMA_GetRegAddr().
  * @param  DACx DAC instance
  * @param  DAC_Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DAC_CHANNEL_1
  *         @arg @ref DDL_DAC_CHANNEL_2 (1)
  *
  *         (1) On this APM32 serie, parameter not available on all devices.
  *             Refer to device datasheet for channels availability.
  * @retval None
  */
__STATIC_INLINE void DDL_DAC_EnableDMAReq(DAC_TypeDef *DACx, uint32_t DAC_Channel)
{
  SET_BIT(DACx->CTRL,
          DAC_CTRL_DMAENCH1 << (DAC_Channel & DAC_CTRL_CHX_BITOFFSET_MASK));
}

